[
  {
    "image": "https://i.ibb.co.com/3YdRzh5s/575dcd9d-a193-4192-84e5-055f03892bb5.jpg",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 1,
    "description": "YouTube is the world’s largest online video-sharing and streaming platform, enabling people everywhere to upload, watch, share, and engage with video content across an immense range of subjects. Founded in 2005 by three former PayPal employees, YouTube quickly transformed from a simple startup into a global cultural force after being acquired by Google in 2006. At its heart, YouTube democratizes media production: anyone with an internet connection can create a channel, publish videos, and reach audiences without traditional gatekeepers. The platform hosts everything from short-form clips and music videos to long-form documentaries, live streams, tutorials, educational lectures, and user-created entertainment. YouTube’s recommendation algorithms play a central role in discovery, suggesting videos tailored to viewers’ interests and viewing histories, which helps users find new creators and niche topics. Community features such as comments, community posts, playlists, and live chat during streams foster interaction and allow creators to build loyal followings. YouTube introduced Shorts to compete with other short-video formats, and it continues to expand features like Chapters, Transcripts, and Premiere to support both creators and viewers. Monetization options such as ad revenue sharing, channel memberships, Super Chat, Super Thanks, and merchandise shelf enable many creators to earn income and turn content creation into a profession. The platform also functions as an important distribution channel for advertisers and brands, which collaborate with creators to produce sponsored content and reach targeted demographics. From an educational perspective, millions of learners and educators rely on YouTube for accessible lessons in science, mathematics, language learning, technology, and the arts, making it a vast informal learning resource. YouTube has given rise to new forms of celebrity and entrepreneurship, with creators launching careers in music, film, publishing, and traditional media, and often using the platform to test ideas and grow audiences. Despite its benefits, YouTube faces complex challenges related to copyright enforcement, content moderation, misinformation, and the balance between free expression and community safety. The company invests in machine learning, human reviewers, and policy updates to address these concerns while seeking to be transparent about enforcement and appeals processes. Accessibility features like captions, auto-translate, and mobile apps ensure content reaches global audiences across many countries and languages.",
    "size": "120MB",
    "reviews": 52000000,
    "ratingAvg": 4.5,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 1800000 },
      { "name": "2 star", "count": 2400000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 30000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDFxMfYZ/Facebook-logo.jpg",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Facebook is the world’s largest online video-sharing and streaming platform, enabling people everywhere to upload, watch, share, and engage with video content across an immense range of subjects. Founded in 2005 by three former PayPal employees, YouTube quickly transformed from a simple startup into a global cultural force after being acquired by Google in 2006. At its heart, YouTube democratizes media production: anyone with an internet connection can create a channel, publish videos, and reach audiences without traditional gatekeepers. The platform hosts everything from short-form clips and music videos to long-form documentaries, live streams, tutorials, educational lectures, and user-created entertainment. YouTube’s recommendation algorithms play a central role in discovery, suggesting videos tailored to viewers’ interests and viewing histories, which helps users find new creators and niche topics. Community features such as comments, community posts, playlists, and live chat during streams foster interaction and allow creators to build loyal followings. YouTube introduced Shorts to compete with other short-video formats, and it continues to expand features like Chapters, Transcripts, and Premiere to support both creators and viewers. Monetization options such as ad revenue sharing, channel memberships, Super Chat, Super Thanks, and merchandise shelf enable many creators to earn income and turn content creation into a profession. The platform also functions as an important distribution channel for advertisers and brands, which collaborate with creators to produce sponsored content and reach targeted demographics. From an educational perspective, millions of learners and educators rely on YouTube for accessible lessons in science, mathematics, language learning, technology, and the arts, making it a vast informal learning resource. .",
    "size": "95MB",
    "reviews": 48000000,
    "ratingAvg": 4.2,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 18000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/prPcJVfH/2aa40498-b68d-4a9d-af36-c8fd110d6bda.jpg",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Instagram is the world’s largest online video-sharing and streaming platform, enabling people everywhere to upload, watch, share, and engage with video content across an immense range of subjects. Founded in 2005 by three former PayPal employees, YouTube quickly transformed from a simple startup into a global cultural force after being acquired by Google in 2006. At its heart, YouTube democratizes media production: anyone with an internet connection can create a channel, publish videos, and reach audiences without traditional gatekeepers. The platform hosts everything from short-form clips and music videos to long-form documentaries, live streams, tutorials, educational lectures, and user-created entertainment. YouTube’s recommendation algorithms play a central role in discovery, suggesting videos tailored to viewers’ interests and viewing histories, which helps users find new creators and niche topics. Community features such as comments, community posts, playlists, and live chat during streams foster interaction and allow creators to build loyal followings. YouTube introduced Shorts to compete with other short-video formats, and it continues to expand features like Chapters, Transcripts, and Premiere to support both creators and viewers. Monetization options such as ad revenue sharing, channel memberships, Super Chat, Super Thanks, and merchandise shelf enable many creators to earn income and turn content creation into a profession. The platform also functions as an important distribution channel for advertisers and brands, which collaborate with creators to produce sponsored content and reach targeted demographics. From an educational perspective, millions of learners and educators rely on YouTube for accessible lessons in science, mathematics, language learning, technology, and the arts, making it a vast informal learning resource. YouTube has given rise to new forms of celebrity and entrepreneurship, with creators launching careers in music, film, publishing, and traditional media, and often using the platform to test ideas and grow audiences. Despite its benefits, YouTube faces complex challenges related to copyright enforcement, content moderation, misinformation, and the balance between free expression and community safety.",
    "size": "110MB",
    "reviews": 43000000,
    "ratingAvg": 4.4,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 17500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/JRv09mpD/b7839d7c-4ad7-4fc2-a0ab-f5b64cd81c7d.jpg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 4,
    "description": "Free messaging and calling app with end-to-end encryption.",
    "size": "90MB",
    "reviews": 60000000,
    "ratingAvg": 4.6,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 38500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/xSd6McmZ/f7765a10-4bb9-492a-8e82-b1ce170aae57.jpg",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 5,
    "description": "Create, share, and discover short videos with trending music.",
    "size": "160MB",
    "reviews": 35000000,
    "ratingAvg": 4.3,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 2500000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 13500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qM6zdJk9/3ae3d17e-9326-43e8-9547-88c0310915f8.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 6,
    "description": "Share moments instantly with friends and enjoy fun filters.",
    "size": "85MB",
    "reviews": 27000000,
    "ratingAvg": 4.2,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1800000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 9000000 },
      { "name": "5 star", "count": 9200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HmtH5k2/a30a6095-8afb-43f6-a5a5-399f699c2763.jpg",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 7,
    "description": "Listen to millions of songs and podcasts for free.",
    "size": "70MB",
    "reviews": 42000000,
    "ratingAvg": 4.7,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1200000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 25800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fYG5QMHt/b08abe4f-6db1-485f-ade0-e9ec5ec6a682.jpg",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 8,
    "description": "Watch your favorite movies, TV shows, and originals anytime.",
    "size": "150MB",
    "reviews": 37000000,
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 5500000 },
      { "name": "4 star", "count": 9500000 },
      { "name": "5 star", "count": 16500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTSkxZPD/Warum-Gro-und-Kleinschreibung-so-wichtig-ist.jpg",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 9,
    "description": "Join the global conversation and share updates instantly.",
    "size": "100MB",
    "reviews": 29000000,
    "ratingAvg": 4.1,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3200000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 7800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/kswXmYPM/Gmail-is-a-free-email-service-developed-by-Google.jpg",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 10,
    "description": "Secure email communication with smart inbox organization.",
    "size": "90MB",
    "reviews": 38000000,
    "ratingAvg": 4.6,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4500000 },
      { "name": "4 star", "count": 9000000 },
      { "name": "5 star", "count": 21800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/1YW1PzqC/d61a9b19-f726-40f5-bcbf-5a61d8b3e455.jpg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 11,
    "description": "Fast, secure, and powerful messaging app with cloud sync.",
    "size": "75MB",
    "reviews": 21000000,
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 1100000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 10100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gZHT0B2h/Logo-do-google-maps-Premium-Vector-Freepik.jpg",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 12,
    "description": "Navigate your world faster with real-time GPS, traffic, and transit info.",
    "size": "130MB",
    "reviews": 40000000,
    "ratingAvg": 4.6,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1300000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 23700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/d06yYYCD/Vector-square-linkedin-logo-isolated-on.jpg",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 13,
    "description": "Connect with professionals, build your career, and find jobs.",
    "size": "80MB",
    "reviews": 18000000,
    "ratingAvg": 4.3,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1200000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 4500000 },
      { "name": "5 star", "count": 8300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/k6SrMNvW/13197da9-a984-4081-ac16-018f2264c7fe.jpg",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 14,
    "description": "Discover and save creative ideas, recipes, and inspirations.",
    "size": "95MB",
    "reviews": 23000000,
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1200000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 10800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TDzcLSgR/4f593034-7876-4b76-86b4-67a620e3dd47.jpg",
    "title": "Zoom",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 15,
    "description": "Video conferencing and online meeting app for teams and individuals.",
    "size": "120MB",
    "reviews": 26000000,
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1800000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 11200000 }
    ]
  }
]
